Tekla.Structures.Plugins.ConnectionBase.InputObjectType
Defines the input object type.

Tekla.Structures.Plugins.ConnectionBase.InputObjectType.INPUTOBJECT_PART
The input object is a part instance.

Tekla.Structures.Plugins.ConnectionBase.InputObjectType.INPUTOBJECT_CUSTOMPART
The input object can be a custom part (component).